{
  "teacher": "Juan Dela Cruz",
  "learningArea": "Mathematics",
  "school": "San Jose Pilot School",
  "gradeLevel": "One",
  "quarterWeek": "Quarter 2, Week 7",
  "lessonTitle": "Addition of 2-Digit Numbers",
  "contentStandards": "The learners demonstrate understanding of addition of numbers with sums up to 100.",
  "performanceStandards": "The learners are able to perform addition of numbers with sums up to 100.",
  "learningCompetencies": "Add numbers with sums up to 100 without regrouping using concrete and pictorial models.",
  "learningObjectives": "At the end of the 45-minute period, the students should be able to add 2-digit and 2-digit numbers without regrouping.",
  "integration": "Reading and writing numerals up to 100 (Literacy).",
  "topicContent": "Pagdaragdag ng Dalawang Bilang na may 2-Digit na ang Kabuuan ay Hanggang 99 Gamit ang Counters na Walang Regrouping",
  "references": "DepEd MATATAG Mathematics 1 Curriculum Guide, Lesson Exemplar",
  "otherResources": "Flashcards, Popsicle sticks (counters), Manila paper, Marker",
  "activePriorKnowledge": "Reviewing previous lesson: Flashcard drill on simple addition (1-digit numbers like 5+4, 3+2).",
  "lessonPurpose": "Ask the students: 'If you have 12 apples and your friend gives you 15 more, how many apples do you have in total?' Today, we will learn how to add big numbers!",
  "lessonPractice": "Introduce vocabulary: Addends, Sum, Plus sign (+), Equals sign (=).",
  "keyIdeaReading": "Read a short story problem about a farmer gathering mangoes in two different baskets.",
  "keyIdeaDevUnderstanding": "Teacher models how to line up the numbers vertically. Show that we add the 'Ones' column first, then the 'Tens' column using popsicle sticks.",
  "keyIdeaDeepUnderstanding": "Group Activity: Give each group a set of 2-digit addition problems and let them solve it using their own counters.",
  "generalization": "Ask the students: 'What do we add first when adding 2-digit numbers?' (Answer: Add the ones first, then the tens).",
  "evaluatingLearning": "Provide a 5-item worksheet. Example: 1. 24 + 13 = ___, 2. 45 + 22 = ___",
  "additionalActivities": "Assignment: Count 20 spoons and 15 forks at home. Add them together and write the sum in your notebook.",
  "remarks": ""
}